models/user/User.php

    public function register()
    {
        if ($this->getIsNewRecord() == false) {
            throw new \RuntimeException('Calling "' . __CLASS__ . '::' . __METHOD__ . '" on existing user');
        }

        $this->confirmed_at = $this->module->enableConfirmation ? null : time();
        $this->password     = $this->module->enableGeneratingPassword ? Password::generate(self::PASSWORD_MIN_LENGTH) : $this->password;

        $this->trigger(self::BEFORE_REGISTER);

        if (!$this->save()) {
---
INSERT INTO `user` (`email`, `username`, `confirmed_at`, `auth_key`, `registration_ip`, `password_hash`, `created_at`, `updated_at`) VALUES ('admin@gmail.com', 'admin', 1481042871, 'aatTlXPJpmh1bzjHk3Wuv--o0NU0rw0D', '127.0.0.1', '$2y$10$E/lQIM7Qf2hrqfKTPQ4ROe15l.zc.pZdH5i/XV7Kil7thhSMViUaW', 1481042871, 1481042871)